[Killed] Block removal mutation
Orders/Print/Receipt/PrintReceipt.cs:22:9
 
         /// <inheritdoc cref="PrintReceipt{Processor}"/>
         public PrintReceipt(PrintProcessor processor)
-        {
-            if (processor == null)
-            {
-                throw new ArgumentNullException(nameof(processor));
-            }
-
-            this.Processor = processor;
-        }
+        {}
 
         /// <inheritdoc cref="IPrintStategy{TDto}.Print(TDto)"/>

[Killed] Equality mutation
Orders/Print/Receipt/PrintReceipt.cs:23:17
         /// <inheritdoc cref="PrintReceipt{Processor}"/>
         public PrintReceipt(PrintProcessor processor)
         {
-            if (processor == null)
+            if (processor != null)
             {
                 throw new ArgumentNullException(nameof(processor));

[Killed] Block removal mutation
Orders/Print/Receipt/PrintReceipt.cs:24:13
         public PrintReceipt(PrintProcessor processor)
         {
             if (processor == null)
-            {
-                throw new ArgumentNullException(nameof(processor));
-            }
+            {}
 
             this.Processor = processor;

[Killed] Statement mutation
Orders/Print/Receipt/PrintReceipt.cs:25:17
         {
             if (processor == null)
             {
-                throw new ArgumentNullException(nameof(processor));
+                ;
             }
 

[Killed] Block removal mutation
Orders/Print/Receipt/PrintReceipt.cs:33:9
 
         /// <inheritdoc cref="IPrintStategy{TDto}.Print(TDto)"/>
         public virtual string Print(ReceiptDto receiptDto)
-        {
-            if (receiptDto == null)
-            {
-                throw new ArgumentNullException(nameof(receiptDto));
-            }
-
-            return this.Processor.Print(receiptDto);
-        }
+        {returndefault;}
     }
 }

[Killed] Equality mutation
Orders/Print/Receipt/PrintReceipt.cs:34:17
         /// <inheritdoc cref="IPrintStategy{TDto}.Print(TDto)"/>
         public virtual string Print(ReceiptDto receiptDto)
         {
-            if (receiptDto == null)
+            if (receiptDto != null)
             {
                 throw new ArgumentNullException(nameof(receiptDto));

[Killed] Block removal mutation
Orders/Print/Receipt/PrintReceipt.cs:35:13
         public virtual string Print(ReceiptDto receiptDto)
         {
             if (receiptDto == null)
-            {
-                throw new ArgumentNullException(nameof(receiptDto));
-            }
+            {}
 
             return this.Processor.Print(receiptDto);

[Killed] Statement mutation
Orders/Print/Receipt/PrintReceipt.cs:36:17
         {
             if (receiptDto == null)
             {
-                throw new ArgumentNullException(nameof(receiptDto));
+                ;
             }
 
