[Killed] Negate expression
Orders/Print/Receipt/ReceiptHtmlStrategy.cs:21:17
                 throw new ArgumentNullException(nameof(receiptDto));
             }
 
-            if (receiptDto.ReceiptLineDtos == null || receiptDto.ReceiptLineDtos.Count == 0)
+            if (!(receiptDto.ReceiptLineDtos == null || receiptDto.ReceiptLineDtos.Count == 0))
             {
                 throw new ArgumentException(nameof(receiptDto.ReceiptLineDtos));

[Killed] Logical mutation
Orders/Print/Receipt/ReceiptHtmlStrategy.cs:21:17
                 throw new ArgumentNullException(nameof(receiptDto));
             }
 
-            if (receiptDto.ReceiptLineDtos == null || receiptDto.ReceiptLineDtos.Count == 0)
+            if (receiptDto.ReceiptLineDtos == null && receiptDto.ReceiptLineDtos.Count == 0)
             {
                 throw new ArgumentException(nameof(receiptDto.ReceiptLineDtos));

[Killed] Block removal mutation
Orders/Print/Receipt/ReceiptHtmlStrategy.cs:22:13
             }
 
             if (receiptDto.ReceiptLineDtos == null || receiptDto.ReceiptLineDtos.Count == 0)
-            {
-                throw new ArgumentException(nameof(receiptDto.ReceiptLineDtos));
-            }
+            {}
 
             var result = new StringBuilder($"<html><body><h1>Order Receipt for {receiptDto.Company}</h1>");

[Killed] Statement mutation
Orders/Print/Receipt/ReceiptHtmlStrategy.cs:23:17
 
             if (receiptDto.ReceiptLineDtos == null || receiptDto.ReceiptLineDtos.Count == 0)
             {
-                throw new ArgumentException(nameof(receiptDto.ReceiptLineDtos));
+                ;
             }
 

[Killed] Negate expression
Orders/Print/Receipt/ReceiptHtmlStrategy.cs:28:17
 
             var result = new StringBuilder($"<html><body><h1>Order Receipt for {receiptDto.Company}</h1>");
 
-            if (receiptDto.ReceiptLineDtos.Count > 0)
+            if (!(receiptDto.ReceiptLineDtos.Count > 0))
             {
                 result.Append("<ul>");

[Killed] Equality mutation
Orders/Print/Receipt/ReceiptHtmlStrategy.cs:28:17
 
             var result = new StringBuilder($"<html><body><h1>Order Receipt for {receiptDto.Company}</h1>");
 
-            if (receiptDto.ReceiptLineDtos.Count > 0)
+            if (receiptDto.ReceiptLineDtos.Count < 0)
             {
                 result.Append("<ul>");

[Killed] Block removal mutation
Orders/Print/Receipt/ReceiptHtmlStrategy.cs:29:13
             var result = new StringBuilder($"<html><body><h1>Order Receipt for {receiptDto.Company}</h1>");
 
             if (receiptDto.ReceiptLineDtos.Count > 0)
-            {
-                result.Append("<ul>");
-
-                foreach (ReceiptLineDto line in receiptDto.ReceiptLineDtos)
-                {
-                    result.Append($"<li>{line.LineQuantity} x {line.BikeBrand} {line.BikeModel} = {line.Amount:C}</li>");
-                }
-
-                result.Append("</ul>");
-            }
+            {}
 
             result.Append($"<h3>Sub-Total: {receiptDto.SubTotal:C}</h3>");

[Killed] Statement mutation
Orders/Print/Receipt/ReceiptHtmlStrategy.cs:30:17
 
             if (receiptDto.ReceiptLineDtos.Count > 0)
             {
-                result.Append("<ul>");
+                ;
 
                 foreach (ReceiptLineDto line in receiptDto.ReceiptLineDtos)

[Killed] Block removal mutation
Orders/Print/Receipt/ReceiptHtmlStrategy.cs:33:17
                 result.Append("<ul>");
 
                 foreach (ReceiptLineDto line in receiptDto.ReceiptLineDtos)
-                {
-                    result.Append($"<li>{line.LineQuantity} x {line.BikeBrand} {line.BikeModel} = {line.Amount:C}</li>");
-                }
+                {}
 
                 result.Append("</ul>");

[Killed] Statement mutation
Orders/Print/Receipt/ReceiptHtmlStrategy.cs:34:21
 
                 foreach (ReceiptLineDto line in receiptDto.ReceiptLineDtos)
                 {
-                    result.Append($"<li>{line.LineQuantity} x {line.BikeBrand} {line.BikeModel} = {line.Amount:C}</li>");
+                    ;
                 }
 

[Killed] String mutation
Orders/Print/Receipt/ReceiptHtmlStrategy.cs:34:35
 
                 foreach (ReceiptLineDto line in receiptDto.ReceiptLineDtos)
                 {
-                    result.Append($"<li>{line.LineQuantity} x {line.BikeBrand} {line.BikeModel} = {line.Amount:C}</li>");
+                    result.Append($"");
                 }
 

[Killed] Statement mutation
Orders/Print/Receipt/ReceiptHtmlStrategy.cs:37:17
                     result.Append($"<li>{line.LineQuantity} x {line.BikeBrand} {line.BikeModel} = {line.Amount:C}</li>");
                 }
 
-                result.Append("</ul>");
+                ;
             }
 

[Killed] Statement mutation
Orders/Print/Receipt/ReceiptHtmlStrategy.cs:40:13
                 result.Append("</ul>");
             }
 
-            result.Append($"<h3>Sub-Total: {receiptDto.SubTotal:C}</h3>");
+            ;
             result.Append($"<h3>Tax: {receiptDto.Tax:C}</h3>");
             result.Append($"<h2>Total: {receiptDto.Total:C}</h2>");

[Killed] Statement mutation
Orders/Print/Receipt/ReceiptHtmlStrategy.cs:41:13
             }
 
             result.Append($"<h3>Sub-Total: {receiptDto.SubTotal:C}</h3>");
-            result.Append($"<h3>Tax: {receiptDto.Tax:C}</h3>");
+            ;
             result.Append($"<h2>Total: {receiptDto.Total:C}</h2>");
             result.Append("</body></html>");

[Killed] Statement mutation
Orders/Print/Receipt/ReceiptHtmlStrategy.cs:42:13
 
             result.Append($"<h3>Sub-Total: {receiptDto.SubTotal:C}</h3>");
             result.Append($"<h3>Tax: {receiptDto.Tax:C}</h3>");
-            result.Append($"<h2>Total: {receiptDto.Total:C}</h2>");
+            ;
             result.Append("</body></html>");
 

[Killed] String mutation
Orders/Print/Receipt/ReceiptHtmlStrategy.cs:42:27
 
             result.Append($"<h3>Sub-Total: {receiptDto.SubTotal:C}</h3>");
             result.Append($"<h3>Tax: {receiptDto.Tax:C}</h3>");
-            result.Append($"<h2>Total: {receiptDto.Total:C}</h2>");
+            result.Append($"");
             result.Append("</body></html>");
 

[Killed] Statement mutation
Orders/Print/Receipt/ReceiptHtmlStrategy.cs:43:13
             result.Append($"<h3>Sub-Total: {receiptDto.SubTotal:C}</h3>");
             result.Append($"<h3>Tax: {receiptDto.Tax:C}</h3>");
             result.Append($"<h2>Total: {receiptDto.Total:C}</h2>");
-            result.Append("</body></html>");
+            ;
 
             return result.ToString();
