[Killed] Block removal mutation
Orders/Print/Receipt/ReceiptStringStrategy.cs:15:9
     {
         /// <inheritdoc cref="IPrintStategy{TDto}.Print(TDto)"/>
         public string Print(ReceiptDto receiptDto)
-        {
-            if (receiptDto == null)
-            {
-                throw new ArgumentNullException(nameof(receiptDto));
-            }
-
-            if (receiptDto.ReceiptLineDtos == null || receiptDto.ReceiptLineDtos.Count == 0)
-            {
-                throw new ArgumentException(nameof(receiptDto.ReceiptLineDtos));
-            }
-
-            var result = new StringBuilder($"Order Receipt for {receiptDto.Company}{Environment.NewLine}");
-
-            foreach (ReceiptLineDto line in receiptDto.ReceiptLineDtos)
-            {
-                result.AppendLine($"\t{line.LineQuantity} x {line.BikeBrand} {line.BikeModel} = {line.Amount:C}");
-            }
-
-            result.AppendLine($"Sub-Total: {receiptDto.SubTotal:C}");
-            result.AppendLine($"Tax: {receiptDto.Tax:C}");
-            result.Append($"Total: {receiptDto.Total:C}");
-
-            return result.ToString();
-        }
+        {returndefault;}
     }
 }

[Killed] Equality mutation
Orders/Print/Receipt/ReceiptStringStrategy.cs:21:55
                 throw new ArgumentNullException(nameof(receiptDto));
             }
 
-            if (receiptDto.ReceiptLineDtos == null || receiptDto.ReceiptLineDtos.Count == 0)
+            if (receiptDto.ReceiptLineDtos == null || receiptDto.ReceiptLineDtos.Count != 0)
             {
                 throw new ArgumentException(nameof(receiptDto.ReceiptLineDtos));

[Killed] String mutation
Orders/Print/Receipt/ReceiptStringStrategy.cs:26:44
                 throw new ArgumentException(nameof(receiptDto.ReceiptLineDtos));
             }
 
-            var result = new StringBuilder($"Order Receipt for {receiptDto.Company}{Environment.NewLine}");
+            var result = new StringBuilder($"");
 
             foreach (ReceiptLineDto line in receiptDto.ReceiptLineDtos)

[Killed] Block removal mutation
Orders/Print/Receipt/ReceiptStringStrategy.cs:29:13
             var result = new StringBuilder($"Order Receipt for {receiptDto.Company}{Environment.NewLine}");
 
             foreach (ReceiptLineDto line in receiptDto.ReceiptLineDtos)
-            {
-                result.AppendLine($"\t{line.LineQuantity} x {line.BikeBrand} {line.BikeModel} = {line.Amount:C}");
-            }
+            {}
 
             result.AppendLine($"Sub-Total: {receiptDto.SubTotal:C}");

[Killed] Statement mutation
Orders/Print/Receipt/ReceiptStringStrategy.cs:30:17
 
             foreach (ReceiptLineDto line in receiptDto.ReceiptLineDtos)
             {
-                result.AppendLine($"\t{line.LineQuantity} x {line.BikeBrand} {line.BikeModel} = {line.Amount:C}");
+                ;
             }
 

[Killed] Statement mutation
Orders/Print/Receipt/ReceiptStringStrategy.cs:33:13
                 result.AppendLine($"\t{line.LineQuantity} x {line.BikeBrand} {line.BikeModel} = {line.Amount:C}");
             }
 
-            result.AppendLine($"Sub-Total: {receiptDto.SubTotal:C}");
+            ;
             result.AppendLine($"Tax: {receiptDto.Tax:C}");
             result.Append($"Total: {receiptDto.Total:C}");

[Killed] String mutation
Orders/Print/Receipt/ReceiptStringStrategy.cs:33:31
                 result.AppendLine($"\t{line.LineQuantity} x {line.BikeBrand} {line.BikeModel} = {line.Amount:C}");
             }
 
-            result.AppendLine($"Sub-Total: {receiptDto.SubTotal:C}");
+            result.AppendLine($"");
             result.AppendLine($"Tax: {receiptDto.Tax:C}");
             result.Append($"Total: {receiptDto.Total:C}");

[Killed] Statement mutation
Orders/Print/Receipt/ReceiptStringStrategy.cs:34:13
             }
 
             result.AppendLine($"Sub-Total: {receiptDto.SubTotal:C}");
-            result.AppendLine($"Tax: {receiptDto.Tax:C}");
+            ;
             result.Append($"Total: {receiptDto.Total:C}");
 

[Killed] Statement mutation
Orders/Print/Receipt/ReceiptStringStrategy.cs:35:13
 
             result.AppendLine($"Sub-Total: {receiptDto.SubTotal:C}");
             result.AppendLine($"Tax: {receiptDto.Tax:C}");
-            result.Append($"Total: {receiptDto.Total:C}");
+            ;
 
             return result.ToString();
