[NoCoverage] Block removal mutation
Domain/UnitOfWork.cs:14:9
         private readonly BikeDistributorContext context;
 
         public UnitOfWork(BikeDistributorContext context)
-        {
-            this.context = context;
-        }
+        {}
 
         public IQueryable<T> Query<T>()

[NoCoverage] Block removal mutation
Domain/UnitOfWork.cs:19:9
         }
 
         public IQueryable<T> Query<T>()
-        {
-            //You do not need to implement this method for the coding exercise
-            throw new System.NotImplementedException();
-        }
+        {}
 
         public async Task<int> SaveChangesAsync(CancellationToken cancellationToken = default)

[NoCoverage] Statement mutation
Domain/UnitOfWork.cs:21:13
         public IQueryable<T> Query<T>()
         {
             //You do not need to implement this method for the coding exercise
-            throw new System.NotImplementedException();
+            ;
         }
 

[NoCoverage] Block removal mutation
Domain/UnitOfWork.cs:25:9
         }
 
         public async Task<int> SaveChangesAsync(CancellationToken cancellationToken = default)
-        {
-            return await this.context.SaveChangesAsync(cancellationToken);
-        }
+        {returndefault;}
     }
 }
